[
    {
        "time": "Aug 2022 - Present",
        "title": "Software Engineer II",
        "company": "Microsoft",
        "copy": ""
    },
    {
        "time": "Mar 2021 - July 2022",
        "title": "Web Developer",
        "company": "Battle Medialab",
        "copy": "Worked full-stack wise to deliver different kinds of web applications to clients ranging from small start-ups to large corporations.;Analyzed weakness and incapacity of a current project, applied reasonable and moderate encapsulation, reduced complexity and made the project more modular.;Architected the whole PWA(Progressive Web Application) project,including data table design, REST API convention,and front-end side architecture (React.js).;Developed offline feature as well as auto-update functionality, utilized IndexedDB instead of cache storage, made large file cache became possible across browsers. (Safari only allows 50MB PWA cache storage at that moment - Oct. 2021);Collaborated with design and video teams to deliver cross-browser optimized and fully responsive UI.;Provided optimized algorithm solution for a project, improved 60% in running time in extreme circumstances.;Improved user interaction greatly on one of the projects, experienced 30% growth in users after three months of release.;"
    },
    {
        "time": "Apr 2019 - Aug 2019",
        "title": "Graduate Research Assistant",
        "company": "Florida International University",
        "copy": "Held a research assistant role in a neuroscience research program using Machine Learning to figure out the relationship between the IQ of one brain and its 3D-scan data.;Implemented several machine learning algorithms including Logical Regression, Random Forest, deep learning, etc.;Applied grid search using Sklearn for Hyperparameter optimization.;Implemented deep learning in TensorFlow and designed a special loss function made the model converge ideally.;"
    },
    {
        "time": "Jun 2017 - Nov 2018",
        "title": "Full-stack Developer",
        "company": "Hengxiya Mechanical Industry",
        "copy": "Responsible for React UI and architecture. Built components library, set up Redux for global state management, and architected a highly maintainable structure.;Used React-Router to turn the application into Single Page Application.; Implemented RESTful-based web service calls to services.;Implemented application using Spring Boot Framework, Spring dependency injection, Spring MVC for REST API.;Used Java-J2EE patterns like Model View Controller (MVC), and some design patterns like Singleton, and Factory.;Developed REST Web APIs to provide services to front-end applications.;Used Hibernate to access data from the DB. Maintained and configured all the Hibernate POJOs using annotations needed for the DB.;Involved in designing database tables with UML diagrams, and in creating the database tables using MySQL.;Followed Scrum Agile methodology for the iterative development of the application."
    }
]
